### AWS UAT App plan Part # 4
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  )%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/app-3fb78100.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/app-3fb78100.js"%0A      + source_hash            = "34f3edeaf68aab44122807a534ba15ab"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/azure_devicon_forest_green-ee780a3a.svg"] will be destroyed%0A  # (because key ["assets/azure_devicon_forest_green-ee780a3a.svg"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "image/svg+xml" -> null%0A      - etag                   = "e60911495dba8bb96def57539a94e9cf" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/azure_devicon_forest_green-ee780a3a.svg" -> null%0A      - key                    = "assets/azure_devicon_forest_green-ee780a3a.svg" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/azure_devicon_forest_green-ee780a3a.svg" -> null%0A      - source_hash            = "e60911495dba8bb96def57539a94e9cf" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/bash_devicon_forest_green-ab536553.svg"] will be destroyed%0A  # (because key ["assets/bash_devicon_forest_green-ab536553.svg"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "image/svg+xml" -> null%0A      - etag                   = "302f026f7e053d0ccf4b0ed827f15900" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/bash_devicon_forest_green-ab536553.svg" -> null%0A      - key                    = "assets/bash_devicon_forest_green-ab536553.svg" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/bash_devicon_forest_green-ab536553.svg" -> null%0A      - source_hash            = "302f026f7e053d0ccf4b0ed827f15900" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/d3_devicon_forest_green-b8696bec.svg"] will be destroyed%0A  # (because key ["assets/d3_devicon_forest_green-b8696bec.svg"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "image/svg+xml" -> null%0A      - etag                   = "89db6545390762231d3913a3cd717cf3" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/d3_devicon_forest_green-b8696bec.svg" -> null%0A      - key                    = "assets/d3_devicon_forest_green-b8696bec.svg" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/d3_devicon_forest_green-b8696bec.svg" -> null%0A      - source_hash            = "89db6545390762231d3913a3cd717cf3" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/devicons-4cbd2440.woff"] will be destroyed%0A  # (because key ["assets/devicons-4cbd2440.woff"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "font/woff" -> null%0A      - etag                   = "a8639dec5833a8375d22fe425b01f4eb" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/devicons-4cbd2440.woff" -> null%0A      - key                    = "assets/devicons-4cbd2440.woff" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/devicons-4cbd2440.woff" -> null%0A      - source_hash            = "a8639dec5833a8375d22fe425b01f4eb" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/devicons-880373aa.eot"] will be destroyed%0A  # (because key ["assets/devicons-880373aa.eot"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/vnd.ms-fontobject" -> null%0A      - etag                   = "36c5ab9318386dc0499a0d89691e6331" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/devicons-880373aa.eot" -> null%0A      - key                    = "assets/devicons-880373aa.eot" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/devicons-880373aa.eot" -> null%0A      - source_hash            = "36c5ab9318386dc0499a0d89691e6331" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/devicons-cbb92633.ttf"] will be destroyed%0A  # (because key ["assets/devicons-cbb92633.ttf"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "font/ttf" -> null%0A      - etag                   = "5ed4d6468a5a0f3cf9c82f854936feab" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/devicons-cbb92633.ttf" -> null%0A      - key                    = "assets/devicons-cbb92633.ttf" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/devicons-cbb92633.ttf" -> null%0A      - source_hash            = "5ed4d6468a5a0f3cf9c82f854936feab" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/devicons-d7c9f264.svg"] will be destroyed%0A  # (because key ["assets/devicons-d7c9f264.svg"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "image/svg+xml" -> null%0A      - etag                   = "a21d3c630e856b5fb26fd3d6f1b894ff" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/devicons-d7c9f264.svg" -> null%0A      - key                    = "assets/devicons-d7c9f264.svg" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/devicons-d7c9f264.svg" -> null%0A      - source_hash            = "a21d3c630e856b5fb26fd3d6f1b894ff" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/fontawesome-webfont-2adefcbc.woff2"] will be destroyed%0A  # (because key ["assets/fontawesome-webfont-2adefcbc.woff2"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "font/woff2" -> null%0A      - etag                   = "af7ae505a9eed503f8b8e6982036873e" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/fontawesome-webfont-2adefcbc.woff2" -> null%0A      - key                    = "assets/fontawesome-webfont-2adefcbc.woff2" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/fontawesome-webfont-2adefcbc.woff2" -> null%0A      - source_hash            = "af7ae505a9eed503f8b8e6982036873e" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/fontawesome-webfont-7bfcab6d.eot"] will be destroyed%0A  # (because key ["assets/fontawesome-webfont-7bfcab6d.eot"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/vnd.ms-fontobject" -> null%0A      - etag                   = "674f50d287a8c48dc19ba404d20fe713" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/fontawesome-webfont-7bfcab6d.eot" -> null%0A      - key                    = "assets/fontawesome-webfont-7bfcab6d.eot" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/fontawesome-webfont-7bfcab6d.eot" -> null%0A      - source_hash            = "674f50d287a8c48dc19ba404d20fe713" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/fontawesome-webfont-aa58f33f.ttf"] will be destroyed%0A  # (because key ["assets/fontawesome-webfont-aa58f33f.ttf"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "font/ttf" -> null%0A      - etag                   = "b06871f281fee6b241d60582ae9369b9" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/fontawesome-webfont-aa58f33f.ttf" -> null%0A      - key                    = "assets/fontawesome-webfont-aa58f33f.ttf" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/fontawesome-webfont-aa58f33f.ttf" -> null%0A      - source_hash            = "b06871f281fee6b241d60582ae9369b9" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/fontawesome-webfont-ad615792.svg"] will be destroyed%0A  # (because key ["assets/fontawesome-webfont-ad615792.svg"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "image/svg+xml" -> null%0A      - etag                   = "912ec66d7572ff821749319396470bde" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/fontawesome-webfont-ad615792.svg" -> null%0A      - key                    = "assets/fontawesome-webfont-ad615792.svg" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/fontawesome-webfont-ad615792.svg" -> null%0A      - source_hash            = "912ec66d7572ff821749319396470bde" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/fontawesome-webfont-ba0c59de.woff"] will be destroyed%0A  # (because key ["assets/fontawesome-webfont-ba0c59de.woff"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "font/woff" -> null%0A      - etag                   = "fee66e712a8a08eef5805a46892932ad" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/fontawesome-webfont-ba0c59de.woff" -> null%0A      - key                    = "assets/fontawesome-webfont-ba0c59de.woff" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/fontawesome-webfont-ba0c59de.woff" -> null%0A      - source_hash            = "fee66e712a8a08eef5805a46892932ad" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/github_profile_pic-66b10136.jpg"] will be destroyed%0A  # (because key ["assets/github_profile_pic-66b10136.jpg"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "image/jpeg" -> null%0A      - etag                   = "a85d8d094e6d9a7903c5829c0ed09432" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/github_profile_pic-66b10136.jpg" -> null%0A      - key                    = "assets/github_profile_pic-66b10136.jpg" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/github_profile_pic-66b10136.jpg" -> null%0A      - source_hash            = "a85d8d094e6d9a7903c5829c0ed09432" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/home-9e3f4fe0.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.marshmallowmeat.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/home-9e3f4fe0.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/home-9e3f4fe0.js"%0A      + source_hash            = "cd039402559a2162186b954dc8634a35"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/html2canvas.esm-0a33ed42.js"] will be destroyed%0A  # (because key ["assets/html2canvas.esm-0a33ed42.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "955bf9b222a46a0897ad2d52916463de" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/html2canvas.esm-0a33ed42.js" -> null%0A      - key                    = "assets/html2canvas.esm-0a33ed42.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/html2canvas.esm-0a33ed42.js" -> null%0A      - source_hash            = "955bf9b222a46a0897ad2d52916463de" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index-9a0f5c31.css"] will be destroyed%0A  # (because key ["assets/index-9a0f5c31.css"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "text/css" -> null%0A      - etag                   = "056b4c93c0fc46fc6fee5d5c316171b9" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/index-9a0f5c31.css" -> null%0A      - key                    = "assets/index-9a0f5c31.css" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/index-9a0f5c31.css" -> null%0A      - source_hash            = "056b4c93c0fc46fc6fee5d5c316171b9" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index-f44d04de.css"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.marshmallowmeat.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "text/css"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/index-f44d04de.css"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/index-f44d04de.css"%0A      + source_hash            = "a202d7ec6bb4ef58e833474ba09f6de7"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index-f711b34b.js"] will be destroyed%0A  # (because key ["assets/index-f711b34b.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "160cfe3790fb9a1b97f9d92d629d225f" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/index-f711b34b.js" -> null%0A      - key                    = "assets/index-f711b34b.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/index-f711b34b.js" -> null%0A      - source_hash            = "160cfe3790fb9a1b97f9d92d629d225f" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index.es-1ae83452.js"] will be destroyed%0A  # (because key ["assets/index.es-1ae83452.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "93628814e00e5563bc178b81e65b273b" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/index.es-1ae83452.js" -> null%0A      - key                    = "assets/index.es-1ae83452.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/index.es-1ae83452.js" -> null%0A      - source_hash            = "93628814e00e5563bc178b81e65b273b" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/powershell_devicon_forest_green-f06a1fda.svg"] will be destroyed%0A  # (because key ["assets/powershell_devicon_forest_green-f06a1fda.svg"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "image/svg+xml" -> null%0A      - etag                   = "3af47f89e61fe763b909c1fabc4c4083" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/powershell_devicon_forest_green-f06a1fda.svg" -> null%0A      - key                    = "assets/powershell_devicon_forest_green-f06a1fda.svg" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/powershell_devicon_forest_green-f06a1fda.svg" -> null%0A      - source_hash            = "3af47f89e61fe763b909c1fabc4c4083" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/purify.es-3ef59d4c.js"] will be destroyed%0A  # (because key ["assets/purify.es-3ef59d4c.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "f17593fbd13b830e8b0da63f75b8f242" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/purify.es-3ef59d4c.js" -> null%0A      - key                    = "assets/purify.es-3ef59d4c.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/purify.es-3ef59d4c.js" -> null%0A      - source_hash            = "f17593fbd13b830e8b0da63f75b8f242" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/recase-24e0a860.js"] will be destroyed%0A  # (because key ["assets/recase-24e0a860.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "d8e1c611a6581a7685243e68e0fdbaa1" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/recase-24e0a860.js" -> null%0A      - key                    = "assets/recase-24e0a860.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/recase-24e0a860.js" -> null%0A      - source_hash            = "d8e1c611a6581a7685243e68e0fdbaa1" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/tableau_logo-ec7acb2d.svg"] will be destroyed%0A  # (because key ["assets/tableau_logo-ec7acb2d.svg"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "image/svg+xml" -> null%0A      - etag                   = "b42fa60cb28ab38ad51179e8b40ff867" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/tableau_logo-ec7acb2d.svg" -> null%0A      - key                    = "assets/tableau_logo-ec7acb2d.svg" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/tableau_logo-ec7acb2d.svg" -> null%0A      - source_hash            = "b42fa60cb28ab38ad51179e8b40ff867" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/terraform_devicon_forest_green-e7c4748a.svg"] will be destroyed%0A  # (because key ["assets/terraform_devicon_forest_green-e7c4748a.svg"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "image/svg+xml" -> null%0A      - etag                   = "ab25c8b031fc668e363745b71dd395a2" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/terraform_devicon_forest_green-e7c4748a.svg" -> null%0A      - key                    = "assets/terraform_devicon_forest_green-e7c4748a.svg" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/terraform_devicon_forest_green-e7c4748a.svg" -> null%0A      - source_hash            = "ab25c8b031fc668e363745b71dd395a2" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ts_devicon_forest_green-0c5eea9d.svg"] will be destroyed%0A  # (because key ["assets/ts_devicon_forest_green-0c5eea9d.svg"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "image/svg+xml" -> null%0A      - etag                   = "52658f776f4a1d3b285bc64c540aa7c5" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/ts_devicon_forest_green-0c5eea9d.svg" -> null%0A      - key                    = "assets/ts_devicon_forest_green-0c5eea9d.svg" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/ts_devicon_forest_green-0c5eea9d.svg" -> null%0A      - source_hash            = "52658f776f4a1d3b285bc64c540aa7c5" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/virtual_pwa-register-181e8f91.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.marshmallowmeat.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/virtual_pwa-register-181e8f91.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/virtual_pwa-register-181e8f91.js"%0A      + source_hash            = "0a909e6776a1c9b995284ff97ce78025"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/vue_devicon_forest_green-2e14a2aa.svg"] will be destroyed%0A  # (because key ["assets/vue_devicon_forest_green-2e14a2aa.svg"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "image/svg+xml" -> null%0A      - etag                   = "b445c5110e3b0a783cfb923e99665079" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/vue_devicon_forest_green-2e14a2aa.svg" -> null%0A      - key                    = "assets/vue_devicon_forest_green-2e14a2aa.svg" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/assets/vue_devicon_forest_green-2e14a2aa.svg" -> null%0A      - source_hash            = "b445c5110e3b0a783cfb923e99665079" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/workbox-window.prod.es5-295a6886.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.marshmallowmeat.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/workbox-window.prod.es5-295a6886.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/workbox-window.prod.es5-295a6886.js"%0A      + source_hash            = "b8c9397a5a7bdb9aee024d2c57d41845"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["favicon-dark.svg"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.marshmallowmeat.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "image/svg+xml"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "favicon-dark.svg"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/favicon-dark.svg"%0A      + source_hash            = "7c40ba0cb1414d1c20f5e60e33e09a5f"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["favicon.ico"] will be destroyed%0A  # (because key ["favicon.ico"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "public-read" -> null%0A      - bucket                 = "uat.marshmallowmeat.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "image/x-icon" -> null%0A      - etag                   = "15789dada2974fe2e62d763285aa97f0" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "favicon.ico" -> null%0A      - key                    = "favicon.ico" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/dist/favicon.ico" -> null%0A      - source_hash            = "15789dada2974fe2e62d763285aa97f0" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.marshmallowmeat.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "marshmallowmeat.com"%0A          - "Project"         = "tf-web"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["favicon.svg"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.marshmallowmeat.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "image/svg+xml"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "favicon.svg"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/favicon.svg"%0A      + source_hash            = "a795ab195c26601ea433babed25a7d0d"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["index.html"] will be updated in-place%0A  ~ resource "aws_s3_bucket_object" "this" {%0A      ~ acl                    = "public-read" -> "private"%0A        id                     = "index.html"%0A      ~ source                 = "./../../../../../app/dist/index.html" -> "./../../../../../app/build/index.html"%0A      ~ source_hash            = "13db61b71093644bed31c47d81552bac" -> "d7f9c9a4660de0cf1c7d3d9abc3b1a4d"%0A        tags                   = {%0A            "Bucket"          = "uat.marshmallowmeat.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "marshmallowmeat.com"%0A            "Project"         = "tf-web"%0A            "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A        # (11 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["manifest.webmanifest"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.marshmallowmeat.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/manifest+json"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "manifest.webmanifest"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/manifest.webmanifest"%0A      + source_hash            = "37e8d18026b05432f623fc5efac2b4b1"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["pwa-192x192.png"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.marshmallowmeat.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "image/png"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "pwa-192x192.png"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/pwa-192x192.png"%0A      + source_hash            = "65f6c00ff3d88d8371df0480c1ba0272"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["pwa-512x512.png"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.marshmallowmeat.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "image/png"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "pwa-512x512.png"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/pwa-512x512.png"%0A      + source_hash            = "20a2db7d5040eb315e6acf49c6983de9"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["readme.html"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.marshmallowmeat.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "readme.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/readme.html"%0A      + source_hash            = "383b8323cb8fe5df65285d5e5e8ab4c3"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["robots.txt"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.marshmallowmeat.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "text/plain"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "robots.txt"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/robots.txt"%0A      + source_hash            = "bc7d77685e5bf6193fe295a198511188"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["safari-pinned-tab.svg"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.marshmallowmeat.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "image/svg+xml"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "safari-pinned-tab.svg"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/safari-pinned-tab.svg"%0A      + source_hash            = "5eaf74d1c43d30e0af743b68a3f48504"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after appl
  ```
  </details>
  *Pusher: @shortpoet, Action: `pull_request`, Working Directory: ``, Workflow: `App Infra`*